#include <iostream.h>
#include <new.h>
#include <stdlib.h>

struct q {
 int ia[1024]; // 2048-байтова структура
 };

main()
{
 struct q*qp; // вказ≥вник на структуру q
 set_new_handler(0); // наказ new повернути 0 у випадку невдач≥
 for(;;) // повторювати наступний оператор "без к≥нц€"
 {
  qp=new q; // вид≥лити нову структуру типу q
  cout << qp << '\n'; // вивсети адресу структури
  if (qp == 0) // у випадку поверненн€ new 0 виконати
  {
    cout << "Out of memory\n"; // вивести пов≥домленн€ про помилку
    exit(1); // перервати програму з кодом завершенн€ 1
  }
 }
return 0; // в цьому р€дку виводитьс€ пов≥домленн€ про помилку "unreachable code"
} 
