/* Пример создания и инициализации
 * массива
 */

#include <iostream>

using namespace std;

int main()
{
    setlocale(LC_ALL, "rus");
    // Пример создания массива
    int my_array [10];
        my_array[0]=12;
        my_array[1]=10;
        my_array[2]=25;
        my_array[3]=26;
        my_array[4]=50;
        my_array[5]=78;
        my_array[6]=112;
        my_array[7]=5;
        my_array[8]=8;
        my_array[9]=9;
    cout<<""<<sizeof my_array<<""<<endl;
    cout<<""<<sizeof my_array[0]<<""<<endl;
// Примеры инициализации
int month[12]={1,5,8,9,15,112,255,158,158,125,18,45};//Применения знака (=)
int month []={1,5,8,9,15,112,255,158,158,125,18,45};//Пример подсчета программой количества элемента массива
int month [] {1,5,8,9,15,112,255,158,158,125,18,45};// пример без знака(=)
int month [5]={0};// присваивания всем элементам значения 0
int month [4]{1};// присваивание первому элементу единицы а остальные элементы получат значение нуля

