import sys

'''
Вхідні дані: 3 дійсних числа a, b, c. Передаються в програму як аргументи командного рядка.
Результат роботи: рядок "triangle", якщо можуть існувати відрізки з такою довжиною та з них можна скласти трикутник, або "not triangle" -- якщо ні.
'''
def task_1(a,b,c):
    # отображение полученных аргументов
    print("Вхідні дані:" + ' ' + str(a) + ' ' + str(b) + ' ' + str(c));

    # проверка аргументов на соответсвиее требованию
    if (a + b) > c and (a + c) > b and (b + c) > a:
        return "triangle";
    else:
        return "not triangle"

'''
Програма має розраховувати числа послідовності Фібоначчі
Вхідні дані: ціле невід'ємне число n. Передається в програму як аргумент командного рядка.
'''
def task_2(n):
    # отображение полученных аргументов
    print("Вхідні дані:" + ' ' + str(x));
    # динамический перерасчет
    a,b = 0,1;
    for i in range(n):
        a,b = b, a + b;
    return a;


# начало алгоритма
arg_count  = len(sys.argv) - 1; # определение количества аргументов не учитывая имя файла
result = None;                  # результат выполнения алгоритма

if arg_count == 1:              # если один аргумент то задание -2
    n = int(sys.argv[1]);       # получаем целое число
    result = task_2(n);         # вычисляем результат

elif arg_count == 3:            # если три аргумента то задание -1
    a = float(sys.argv[1]);     # получаем первое действительное число
    b = float(sys.argv[2]);     # получаем второе действительное число
    c = float(sys.argv[3]);     # получаем третье действительное число
    result = task_1(a,b,c);
else:
    print("Не корректные входные данные");

# вывод результата
print("Результат: " + str(result));
